Repository: FlamingWater35/QuickScan
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fi, fr, hi, id, pt, zh

# noCodeFoundMessage
source: No readable code found in the QR code.
ar: لم يتم العثور على أي رمز قابل للقراءة في رمز QR.
es: No se encontró un código legible en el código QR.
fi: Kuvasta ei löytynyt luettavaa koodia.
fr: Aucun code lisible trouvé dans le QR code.
hi: QR कोड में कोई पठनीय कोड नहीं मिला।
id: Tidak ada kode yang dapat dibaca ditemukan dalam QR code.
pt: Nenhum código legível encontrado no código QR.
zh: 在二维码中未找到可读代码。

# noQrCodeFoundMessage
source: No QR code found in the selected image.
ar: لم يتم العثور على رمز QR في الصورة المحددة.
es: No se encontró ningún código QR en la imagen seleccionada.
fi: Valitusta kuvasta ei löytynyt QR-koodia.
fr: Aucun QR code trouvé dans l'image sélectionnée.
hi: चयनित छवि में कोई QR कोड नहीं मिला।
id: Tidak ada QR code ditemukan dalam gambar yang dipilih.
pt: Nenhum código QR encontrado na imagem selecionada.
zh: 在所选图片中未找到二维码。

# imageScanError
source: Error scanning image: {error}
ar: خطأ في مسح الصورة: {error}
es: Error al escanear la imagen: {error}
fi: Virhe kuvan skannauksessa: {error}
fr: Erreur lors du scan de l'image : {error}
hi: छवि स्कैन करने में त्रुटि: {error}
id: Gagal memindai gambar: {error}
pt: Erro ao escanear a imagem: {error}
zh: 扫描图片出错: {error}

# settingsScreenTitle
source: Settings
ar: الإعدادات
es: Configuración
fi: Asetukset
fr: Paramètres
hi: सेटिंग्स
id: Pengaturan
pt: Configurações
zh: 设置

# appearanceSectionTitle
source: Appearance
ar: المظهر
es: Apariencia
fi: Ulkoasu
fr: Apparence
hi: दिखावट
id: Tampilan
pt: Aparência
zh: 外观

# applicationSectionTitle
source: Application
ar: التطبيق
es: Aplicación
fi: Sovellus
hi: एप्लिकेशन
id: Aplikasi
pt: Aplicativo
zh: 应用

# lightThemeLabel
source: Light
ar: فاتح
es: Claro
fi: Vaalea
fr: Clair
hi: हल्का
id: Terang
pt: Claro
zh: 浅色

# darkThemeLabel
source: Dark
ar: غامق
es: Oscuro
fi: Tumma
fr: Sombre
hi: गहरा
id: Gelap
pt: Escuro
zh: 深色

# systemThemeLabel
source: System
ar: النظام
es: Sistema
fi: Järjestelmä
fr: Système
hi: सिस्टम
id: Sistem
pt: Sistema
zh: 系统

# checkForUpdatesLabel
source: Check for Updates
ar: التحقق من التحديثات
es: Buscar Actualizaciones
fi: Tarkista Päivitykset
fr: Vérifier les Mises à Jour
hi: अपडेट के लिए जांचें
id: Periksa Pembaruan
pt: Verificar Atualizações
zh: 检查更新

# versionLoadingText
source: Loading...
ar: جاري التحميل...
es: Cargando...
fi: Ladataan...
fr: Chargement...
hi: लोड हो रहा है...
id: Memuat...
pt: Carregando...
zh: 加载中...

# versionErrorText
source: Error loading version
ar: خطأ في تحميل الإصدار
es: Error al cargar la versión
fi: Virhe version latauksessa
fr: Erreur de chargement de la version
hi: संस्करण लोड करने में त्रुटि
id: Gagal memuat versi
pt: Erro ao carregar a versão
zh: 加载版本信息出错

# versionFormat
source: Version {version} ({buildNumber})
ar: الإصدار {version} ({buildNumber})
es: Versión {version} ({buildNumber})
fi: Versio {version} ({buildNumber})
hi: संस्करण {version} ({buildNumber})
id: Versi {version} ({buildNumber})
pt: Versão {version} ({buildNumber})
zh: 版本 {version} ({buildNumber})

# updateScreenTitle
source: App Update
ar: تحديث التطبيق
es: Actualización de la Aplicación
fi: Sovelluksen Päivitys
fr: Mise à Jour de l'Application
hi: ऐप अपडेट
id: Pembaruan Aplikasi
pt: Atualização do Aplicativo
zh: 应用更新

source: Checking for updates...
ar: جاري التحقق من التحديثات...
es: Buscando actualizaciones...
fi: Tarkistetaan päivityksiä...
fr: Vérification des mises à jour...
hi: अपडेट के लिए जांच की जा रही है...
id: Memeriksa pembaruan...
pt: Verificando atualizações...
zh: 正在检查更新...

source: Update Available!
ar: تحديث متاح!
es: ¡Actualización Disponible!
fi: Päivitys Saatavilla!
fr: Mise à Jour Disponible !
hi: अपडेट उपलब्ध!
id: Pembaruan Tersedia!
pt: Atualização Disponível!
zh: 有可用更新！

# currentVersionLabel
source: Current version: {version}
ar: الإصدار الحالي: {version}
es: Versión actual: {version}
fi: Nykyinen versio: {version}
fr: Version actuelle : {version}
hi: वर्तमान संस्करण: {version}
id: Versi saat ini: {version}
pt: Versão atual: {version}
zh: 当前版本: {version}

# newVersionLabel
source: New version: {version}
ar: الإصدار الجديد: {version}
es: Nueva versión: {version}
fi: Uusi versio: {version}
fr: Nouvelle version : {version}
hi: नया संस्करण: {version}
id: Versi baru: {version}
pt: Nova versão: {version}
zh: 新版本: {version}

# latestVersionLabel
source: (Latest available: {version})
ar: (أحدث إصدار متاح: {version})
es: (Última disponible: {version})
fi: (Viimeisin saatavilla: {version})
fr: (Dernière version disponible : {version})
hi: (नवीनतम उपलब्ध: {version})
id: (Versi terbaru yang tersedia: {version})
pt: (Última disponível: {version})
zh: (最新可用: {version})

# downloadAndInstallButton
source: Download & Install
ar: تنزيل وتثبيت
es: Descargar e Instalar
fi: Lataa ja Asenna
fr: Télécharger & Installer
hi: डाउनलोड और इंस्टॉल करें
id: Unduh & Pasang
pt: Baixar e Instalar
zh: 下载并安装

# downloadingUpdate
source: Downloading update ({version})...
ar: جاري تنزيل التحديث ({version})...
es: Descargando actualización ({version})...
fi: Ladataan päivitystä ({version})...
fr: Téléchargement de la mise à jour ({version})...
hi: अपडेट डाउनलोड हो रहा है ({version})...
id: Mengunduh pembaruan ({version})...
pt: Baixando atualização ({version})...
zh: 正在下载更新({version})...

source: Starting install...
ar: جاري بدء التثبيت...
es: Iniciando instalación...
fi: Aloitetaan asennus...
fr: Début de l'installation...
hi: इंस्टॉलेशन शुरू हो रहा है...
id: Memulai pemasangan...
pt: Iniciando instalação...
zh: 开始安装...

source: Update Failed
ar: فشل التحديث
es: Actualización Fallida
fi: Päivitys Epäonnistui
fr: Échec de la Mise à Jour
hi: अपडेट विफल
id: Pembaruan Gagal
pt: Atualização Falhou
zh: 更新失败

# retryCheckButton
source: Retry Check
ar: إعادة المحاولة
es: Reintentar Búsqueda
fi: Yritä Uudelleen
fr: Réessayer la Vérification
hi: पुनः जांचें
id: Coba Lagi
pt: Tentar Novamente
zh: 重试检查

# upToDate
source: You're up to date!
ar: أنت محدث!
es: ¡Estás al día!
fi: Olet ajan tasalla!
fr: Vous êtes à jour !
hi: आप अप-टू-डेट हैं!
id: Anda sudah menggunakan versi terbaru!
pt: Você está atualizado!
zh: 您已是最新版本！

# checkAgainButton
source: Check Again
ar: تحقق مرة أخرى
es: Buscar de Nuevo
fi: Tarkista Uudelleen
fr: Vérifier à Nouveau
hi: फिर से जांचें
id: Periksa Lagi
pt: Verificar Novamente
zh: 再次检查

source: Install dialog shown
ar: تم عرض مربع حوار التثبيت
es: Diálogo de instalación mostrado
fi: Asennusikkuna näytetty
fr: Dialogue d'installation affiché
hi: इंस्टॉल डायलॉग दिखाया गया
id: Dialog pemasangan ditampilkan
pt: Diálogo de instalação exibido
zh: 安装对话框已显示

# noUpdateAvailable
source: No new update available.
ar: لا تتوفر تحديثات جديدة.
es: No hay actualizaciones disponibles.
fi: Uusia päivityksiä ei saatavilla.
fr: Aucune nouvelle mise à jour disponible.
hi: कोई नया अपडेट उपलब्ध नहीं है।
id: Tidak ada pembaruan baru yang tersedia.
pt: Nenhuma nova atualização disponível.
zh: 没有可用更新。

# unexpectedErrorDuringCheck
source: An unexpected error occurred during check.
ar: حدث خطأ غير متوقع أثناء التحقق.
es: Ocurrió un error inesperado durante la búsqueda.
fi: Päivitysten tarkistuksessa tapahtui odottamaton virhe.
fr: Une erreur inattendue s'est produite lors de la vérification.
hi: जांच के दौरान एक अप्रत्याशित त्रुटि हुई।
id: Terjadi kesalahan tak terduga saat memeriksa.
pt: Ocorreu um erro inesperado durante a verificação.
zh: 检查更新时发生意外错误。

# updateInfoIncomplete
source: Update information is incomplete.
ar: معلومات التحديث غير مكتملة.
es: La información de actualización está incompleta.
fi: Päivitystiedot ovat puutteelliset.
fr: Les informations de mise à jour sont incomplètes.
hi: अपडेट जानकारी अधूरी है।
id: Informasi pembaruan tidak lengkap.
pt: Informações de atualização incompletas.
zh: 更新信息不完整。

# downloadFailed
source: Download failed. Check connection and permissions.
ar: فشل التنزيل. تحقق من الاتصال والأذونات.
es: Descarga fallida. Verifica la conexión y los permisos.
fi: Lataus epäonnistui. Tarkista yhteys ja käyttöoikeudet.
fr: Échec du téléchargement. Vérifiez la connexion et les permissions.
hi: डाउनलोड विफल। कनेक्शन और अनुमतियाँ जांचें।
id: Pengunduhan gagal. Periksa koneksi dan izin.
pt: Falha no download. Verifique a conexão e permissões.
zh: 下载失败。请检查连接和权限。

# installationFailed
source: Could not start installation. Check permissions.
ar: تعذر بدء التثبيت. تحقق من الأذونات.
es: No se pudo iniciar la instalación. Verifica los permisos.
fi: Asennuksen aloittaminen epäonnistui. Tarkista käyttöoikeudet.
fr: Impossible de démarrer l'installation. Vérifiez les permissions.
hi: इंस्टॉलेशन शुरू नहीं कर सका। अनुमतियाँ जांचें।
id: Tidak dapat memulai pemasangan. Periksa izin.
pt: Não foi possível iniciar a instalação. Verifique as permissões.
zh: 无法开始安装。请检查权限。
