Repository: FlamingWater35/QuickScan
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fi, fr, hi, id, pt, zh

# appTitle
source: Simple Scanner
ar: ماسح بسيط
es: Escáner Simple
fi: Yksinkertainen Skanneri
fr: Scanner Simple
hi: सरल स्कैनर
id: Pemindai Sederhana
pt: Scanner Simples
zh: 简易扫描器

# languageSectionTitle
source: Language
ar: اللغة
es: Idioma
fi: Kieli
fr: Langue
hi: भाषा
id: Bahasa
pt: Idioma
zh: 语言

# scannerTabLabel
source: Camera
ar: الكاميرا
es: Cámara
fi: Kamera
fr: Caméra
hi: कैमरा
id: Kamera
pt: Câmera
zh: 相机

# fileTabLabel
source: File
ar: ملف
es: Archivo
fi: Tiedosto
fr: Fichier
hi: फ़ाइल
id: Berkas
pt: Arquivo
zh: 文件

# settingsTabLabel
source: Settings
ar: الإعدادات
es: Configuración
fi: Asetukset
fr: Paramètres
hi: सेटिंग्स
id: Pengaturan
pt: Configurações
zh: 设置

# scannerTabTitle
source: Scan QR Code
ar: مسح رمز QR
es: Escanear Código QR
fi: Skannaa QR-koodi
fr: Scanner un QR Code
hi: QR कोड स्कैन करें
id: Pindai QR Code
pt: Escanear Código QR
zh: 扫描二维码

# scannerTabScanText
source: Align QR code within frame to scan
ar: قم بمحاذاة رمز QR داخل الإطار للمسح
es: Alinea el código QR dentro del marco para escanear
fi: Kohdista QR-koodi kehykseen skannataksesi
fr: Alignez le QR code dans le cadre pour le scanner
hi: स्कैन करने के लिए QR कोड को फ्रेम में संरेखित करें
id: Sejajarkan QR code dalam bingkai untuk memindai
pt: Alinhe o código QR dentro do quadro para escanear
zh: 将二维码对准取景框进行扫描

# cameraPermissionRequestText
source: Camera permission is required to scan QR codes. Please grant permission.
ar: يتطلب مسح رموز QR إذن الكاميرا. يرجى منح الإذن.
es: Se requiere permiso de cámara para escanear códigos QR. Por favor, concede el permiso.
fi: Kameran käyttöoikeus vaaditaan QR-koodien skannaamiseen. Anna lupa.
fr: L'autorisation de la caméra est requise pour scanner les QR codes. Veuillez accorder la permission.
hi: QR कोड स्कैन करने के लिए कैमरा अनुमति आवश्यक है। कृपया अनुमति दें।
id: Izin kamera diperlukan untuk memindai QR code. Harap berikan izin.
pt: É necessária permissão da câmera para escanear códigos QR. Por favor, conceda a permissão.
zh: 扫描二维码需要相机权限，请授予权限。

# cameraPermissionRestrictedText
source: Camera access is restricted (e.g., by device policy or parental controls). Scanning is unavailable.
ar: تم تقييد الوصول إلى الكاميرا (على سبيل المثال، بواسطة سياسة الجهاز أو ضوابط الوالدين). المسح غير متاح.
es: El acceso a la cámara está restringido (por ejemplo, por políticas del dispositivo o controles parentales). El escaneo no está disponible.
fi: Kameran käyttö on rajoitettu (esim. laitekäytännön tai vanhempien valvontojen vuoksi). Skannaus ei ole mahdollista.
fr: L'accès à la caméra est restreint (par exemple, par une politique d'appareil ou des contrôles parentaux). Le scan est indisponible.
hi: कैमरा एक्सेस प्रतिबंधित है (जैसे, डिवाइस पॉलिसी या पैरेंटल कंट्रोल द्वारा)। स्कैनिंग उपलब्ध नहीं है।
id: Akses kamera dibatasi (misalnya, oleh kebijakan perangkat atau kontrol orang tua). Pemindaian tidak tersedia.
pt: O acesso à câmera está restrito (por exemplo, por política do dispositivo ou controles parentais). O escaneamento não está disponível.
zh: 相机访问受限（如被设备策略或家长控制限制）。无法扫描。

# cameraPermissionPermanentlyDeniedText
source: Camera permission is permanently denied. Please enable it in app settings to scan QR codes.
ar: تم رفض إذن الكاميرا بشكل دائم. يرجى تمكينه في إعدادات التطبيق لمسح رموز QR.
es: El permiso de cámara está denegado permanentemente. Por favor, actívalo en la configuración de la aplicación para escanear códigos QR.
fi: Kameran käyttöoikeus on pysyvästi evätty. Ota se käyttöön sovelluksen asetuksista skannataksesi QR-koodeja.
fr: L'autorisation de la caméra est refusée de manière permanente. Veuillez l'activer dans les paramètres de l'application pour scanner les QR codes.
hi: कैमरा अनुमति स्थायी रूप से अस्वीकृत है। QR कोड स्कैन करने के लिए कृपया ऐप सेटिंग्स में इसे सक्षम करें।
id: Izin kamera ditolak secara permanen. Harap aktifkan di pengaturan aplikasi untuk memindai QR code.
pt: A permissão da câmera foi permanentemente negada. Por favor, habilite-a nas configurações do aplicativo para escanear códigos QR.
zh: 相机权限被永久拒绝。请在应用设置中启用以扫描二维码。

# openSettingsText
source: Open Settings
ar: فتح الإعدادات
es: Abrir Configuración
fi: Avaa Asetukset
fr: Ouvrir les Paramètres
hi: सेटिंग्स खोलें
id: Buka Pengaturan
pt: Abrir Configurações
zh: 打开设置

# grantPermissionText
source: Grant Permission
ar: منح الإذن
es: Conceder Permiso
fi: Anna Lupa
fr: Accorder la Permission
hi: अनुमति दें
id: Berikan Izin
pt: Conceder Permissão
zh: 授予权限

# couldNotPerformActionText
source: Could not perform action for {uri}
ar: تعذر تنفيذ الإجراء لـ {uri}
es: No se pudo realizar la acción para {uri}
fi: Toiminnon suorittaminen epäonnistui kohteelle {uri}
fr: Impossible d'effectuer l'action pour {uri}
hi: {uri} के लिए कार्रवाई नहीं कर सका
id: Tidak dapat melakukan tindakan untuk {uri}
pt: Não foi possível realizar a ação para {uri}
zh: 无法为 {uri} 执行操作

# urlLaunchError
source: Error launching link: {error}
ar: خطأ في فتح الرابط: {error}
es: Error al abrir el enlace: {error}
fi: Linkin avaaminen epäonnistui: {error}
fr: Erreur lors du lancement du lien : {error}
hi: लिंक लॉन्च करने में त्रुटि: {error}
id: Gagal membuka tautan: {error}
pt: Erro ao abrir o link: {error}
zh: 打开链接出错: {error}

# scanResultTitle
source: Scan Result
ar: نتيجة المسح
es: Resultado del Escaneo
fi: Skannauksen Tulos
fr: Résultat du Scan
hi: स्कैन परिणाम
id: Hasil Pindaian
pt: Resultado do Escaneamento
zh: 扫描结果

source: Scan Successful!
ar: تم المسح بنجاح!
es: ¡Escaneo Exitoso!
fi: Skannaus Onnistui!
fr: Scan Réussi !
hi: स्कैन सफल!
id: Pindaian Berhasil!
pt: Escaneamento Bem-Sucedido!
zh: 扫描成功！

source: Copy Raw Value
ar: نسخ القيمة الخام
es: Copiar Valor Original
fi: Kopioi Raaka Arvo
fr: Copier la Valeur Brute
hi: कच्चा मान कॉपी करें
id: Salin Nilai Mentah
pt: Copiar Valor Bruto
zh: 复制原始值

source: Raw value copied!
ar: تم نسخ القيمة الخام!
es: ¡Valor original copiado!
fi: Raaka arvo kopioitu!
fr: Valeur brute copiée !
hi: कच्चा मान कॉपी किया गया!
id: Nilai mentah disalin!
pt: Valor bruto copiado!
zh: 原始值已复制！

source: Link Found!
ar: تم العثور على رابط!
es: ¡Enlace Encontrado!
fi: Linkki Löytyi!
fr: Lien Trouvé !
hi: लिंक मिला!
id: Tautan Ditemukan!
pt: Link Encontrado!
zh: 发现链接！

source: Open Link
ar: فتح الرابط
es: Abrir Enlace
fi: Avaa Linkki
fr: Ouvrir le Lien
hi: लिंक खोलें
id: Buka Tautan
pt: Abrir Link
zh: 打开链接

source: Phone Number Found!
ar: تم العثور على رقم هاتف!
es: ¡Número de Teléfono Encontrado!
fi: Puhelinnumero Löytyi!
fr: Numéro de Téléphone Trouvé !
hi: फोन नंबर मिला!
id: Nomor Telepon Ditemukan!
pt: Número de Telefone Encontrado!
zh: 发现电话号码！

source: Dial Number
ar: اتصال بالرقم
es: Marcar Número
fi: Soita Numeroon
fr: Composer le Numéro
hi: नंबर डायल करें
id: Hubungi Nomor
pt: Discar Número
zh: 拨打电话

source: Email Address Found!
ar: تم العثور على عنوان بريد إلكتروني!
es: ¡Correo Electrónico Encontrado!
fi: Sähköpostiosoite Löytyi!
fr: Adresse Email Trouvée !
hi: ईमेल पता मिला!
id: Alamat Email Ditemukan!
pt: Endereço de E-mail Encontrado!
zh: 发现电子邮件地址！

source: Send Email
ar: إرسال بريد إلكتروني
es: Enviar Correo
fi: Lähetä Sähköposti
fr: Envoyer un Email
hi: ईमेल भेजें
id: Kirim Email
pt: Enviar E-mail
zh: 发送邮件

source: Copy Email Address
ar: نسخ عنوان البريد الإلكتروني
es: Copiar Correo Electrónico
fi: Kopioi Sähköpostiosoite
fr: Copier l'Adresse Email
hi: ईमेल पता कॉपी करें
id: Salin Alamat Email
pt: Copiar Endereço de E-mail
zh: 复制邮箱地址

source: Email address copied!
ar: تم نسخ عنوان البريد الإلكتروني!
es: ¡Correo electrónico copiado!
fi: Sähköpostiosoite kopioitu!
fr: Adresse email copiée !
hi: ईमेल पता कॉपी किया गया!
id: Alamat email disalin!
pt: Endereço de e-mail copiado!
zh: 邮箱地址已复制！

source: SMS Details Found!
ar: تم العثور على تفاصيل SMS!
es: ¡Detalles de SMS Encontrados!
fi: SMS-tiedot Löytyivät!
fr: Détails de SMS Trouvés !
hi: SMS विवरण मिला!
id: Detail SMS Ditemukan!
pt: Detalhes de SMS Encontrados!
zh: 发现短信详情！

source: Send SMS
ar: إرسال SMS
es: Enviar SMS
fi: Lähetä SMS
fr: Envoyer un SMS
hi: SMS भेजें
id: Kirim SMS
pt: Enviar SMS
zh: 发送短信

source: Wi-Fi Network Found!
ar: تم العثور على شبكة Wi-Fi!
es: ¡Red Wi-Fi Encontrada!
fi: Wi-Fi-verkko Löytyi!
fr: Réseau Wi-Fi Trouvé !
hi: Wi-Fi नेटवर्क मिला!
id: Jaringan Wi-Fi Ditemukan!
pt: Rede Wi-Fi Encontrada!
zh: 发现Wi-Fi网络！

source: Copy Wi-Fi Info
ar: نسخ معلومات Wi-Fi
es: Copiar Información Wi-Fi
fi: Kopioi Wi-Fi-tiedot
fr: Copier les Infos Wi-Fi
hi: Wi-Fi जानकारी कॉपी करें
id: Salin Info Wi-Fi
pt: Copiar Informações do Wi-Fi
zh: 复制Wi-Fi信息

# wifiCredentialsCopied
source: Wi-Fi credentials copied to clipboard!
ar: تم نسخ بيانات اعتماد Wi-Fi!
es: ¡Credenciales Wi-Fi copiadas al portapapeles!
fi: Wi-Fi-kirjautumistiedot kopioitu leikepöydälle!
fr: Identifiants Wi-Fi copiés !
hi: Wi-Fi क्रेडेंशियल्स क्लिपबोर्ड पर कॉपी किए गए!
id: Kredensial Wi-Fi disalin!
pt: Credenciais do Wi-Fi copiadas para a área de transferência!
zh: Wi-Fi凭证已复制到剪贴板！

# wifiManualNote
source: Note: Paste copied info into Wi-Fi settings manually.
ar: ملاحظة: الصق المعلومات المنسوخة في إعدادات Wi-Fi يدويًا.
es: Nota: Pega la información copiada en la configuración de Wi-Fi manualmente.
fi: Huom: Liitä kopioitu tieto Wi-Fi-asetuksiin manuaalisesti.
fr: Note : Collez les informations copiées dans les paramètres Wi-Fi manuellement.
hi: नोट: कॉपी की गई जानकारी को Wi-Fi सेटिंग्स में मैन्युअली पेस्ट करें।
id: Catatan: Tempel info yang disalin ke pengaturan Wi-Fi secara manual.
pt: Nota: Cole as informações copiadas nas configurações de Wi-Fi manualmente.
zh: 注意：请手动将复制的信息粘贴到Wi-Fi设置中。

source: Contact Info Found!
ar: تم العثور على معلومات الاتصال!
es: ¡Información de Contacto Encontrada!
fi: Yhteystiedot Löytyivät!
fr: Informations de Contact Trouvées !
hi: संपर्क जानकारी मिली!
id: Info Kontak Ditemukan!
pt: Informações de Contato Encontradas!
zh: 发现联系人信息！

# exportVCard
source: Export vCard (.vcf)
ar: تصدير vCard (.vcf)
es: Exportar vCard (.vcf)
fi: Vie vCard (.vcf)
fr: Exporter vCard (.vcf)
hi: vCard (.vcf) निर्यात करें
id: Ekspor vCard (.vcf)
pt: Exportar vCard (.vcf)
zh: 导出vCard (.vcf)

# vCardSaved
source: vCard saved successfully!
ar: تم حفظ vCard بنجاح!
es: ¡vCard guardada con éxito!
fi: vCard tallennettu onnistuneesti!
fr: vCard enregistrée avec succès !
hi: vCard सफलतापूर्वक सहेजा गया!
id: vCard berhasil disimpan!
pt: vCard salvo com sucesso!
zh: vCard保存成功！

# vCardExportCancelled
source: vCard export cancelled or failed.
ar: تم إلغاء تصدير vCard أو فشل.
es: Exportación de vCard cancelada o fallida.
fi: vCard-vienti peruutettu tai epäonnistui.
fr: Export de vCard annulé ou échoué.
hi: vCard निर्यात रद्द या विफल हुआ।
id: Ekspor vCard dibatalkan atau gagal.
pt: Exportação de vCard cancelada ou falhou.
zh: vCard导出已取消或失败。

# vCardExportError
source: Error exporting vCard: {error}
ar: خطأ في تصدير vCard: {error}
es: Error al exportar vCard: {error}
fi: Virhe vCard-viennissä: {error}
fr: Erreur lors de l'export de la vCard : {error}
hi: vCard निर्यात करने में त्रुटि: {error}
id: Gagal mengekspor vCard: {error}
pt: Erro ao exportar vCard: {error}
zh: 导出vCard出错: {error}

source: Location Found!
ar: تم العثور على موقع!
es: ¡Ubicación Encontrada!
fi: Sijainti Löytyi!
fr: Localisation Trouvée !
hi: स्थान मिला!
id: Lokasi Ditemukan!
pt: Localização Encontrada!
zh: 发现地理位置！

source: Open in Maps
ar: فتح في الخرائط
es: Abrir en Mapas
fi: Avaa Kartassa
fr: Ouvrir dans les Cartes
hi: मानचित्र में खोलें
id: Buka di Peta
pt: Abrir no Mapas
zh: 在地图中打开

source: Calendar Event Found!
ar: تم العثور على حدث تقويم!
es: ¡Evento de Calendario Encontrado!
fi: Kalenteritapahtuma Löytyi!
fr: Événement Calendrier Trouvé !
hi: कैलेंडर इवेंट मिला!
id: Acara Kalender Ditemukan!
pt: Evento de Calendário Encontrado!
zh: 发现日历事件！

source: Text Found
ar: تم العثور على نص
es: Texto Encontrado
fi: Teksti Löytyi
fr: Texte Trouvé
hi: पाठ मिला
id: Teks Ditemukan
pt: Texto Encontrado
zh: 发现文本

source: ISBN Found
ar: تم العثور على ISBN
es: ISBN Encontrado
fi: ISBN Löytyi
fr: ISBN Trouvé
hi: ISBN मिला
id: ISBN Ditemukan
pt: ISBN Encontrado
zh: 发现ISBN

source: Product Code Found
ar: تم العثور على رمز منتج
es: Código de Producto Encontrado
fi: Tuotekoodi Löytyi
fr: Code Produit Trouvé
hi: उत्पाद कोड मिला
id: Kode Produk Ditemukan
pt: Código de Produto Encontrado
zh: 发现产品代码

source: Driver License Found
ar: تم العثور على رخصة قيادة
es: Licencia de Conducir Encontrada
fi: Kuljettajan Lisenssi Löytyi
fr: Permis de Conduire Trouvé
hi: ड्राइवर लाइसेंस मिला
id: SIM Ditemukan
pt: Carteira de Motorista Encontrada
zh: 发现驾驶证信息

# contactInfoLabel
source: Contact Info (vCard):
ar: معلومات الاتصال (vCard):
es: Información de Contacto (vCard):
fi: Yhteystiedot (vCard):
fr: Informations de Contact (vCard) :
hi: संपर्क जानकारी (vCard):
id: Info Kontak (vCard):
pt: Informações de Contato (vCard):
zh: 联系人信息(vCard):

# saveContactDialogTitle
source: Save Contact
ar: حفظ جهة اتصال
es: Guardar Contacto
fi: Tallenna Yhteystieto
fr: Enregistrer le Contact
hi: संपर्क सहेजें
id: Simpan Kontak
pt: Salvar Contato
zh: 保存联系人

# noneLabel
source: (none)
ar: (لا شيء)
es: (ninguno)
fi: (ei mitään)
fr: (aucun)
hi: (कोई नहीं)
id: (tidak ada)
pt: (nenhum)
zh: (无)

# calendarEventLabel
source: Calendar Event (iCal):
ar: حدث التقويم (iCal):
es: Evento de Calendario (iCal):
fi: Kalenteritapahtuma (iCal):
fr: Événement Calendrier (iCal) :
hi: कैलेंडर इवेंट (iCal):
id: Acara Kalender (iCal):
pt: Evento de Calendário (iCal):
zh: 日历事件(iCal):

# driverLicenseLabel
source: Driver License Data:
ar: بيانات رخصة القيادة:
es: Datos de Licencia de Conducir:
fi: Kuljettajan Lisenssin Tiedot:
fr: Données du Permis de Conduire :
hi: ड्राइवर लाइसेंस डेटा:
id: Data SIM:
pt: Dados da Carteira de Motorista:
zh: 驾驶证数据:

# rawDataLabel
source: Raw Data:
ar: بيانات خام:
es: Datos Originales:
fi: Raaka Data:
fr: Données Brutes :
hi: कच्चा डेटा:
id: Data Mentah:
pt: Dados Brutos:
zh: 原始数据:

# nameLabel
source: Name:
ar: الاسم:
es: Nombre:
fi: Nimi:
fr: Nom :
hi: नाम:
id: Nama:
pt: Nome:
zh: 姓名:

# organizationLabel
source: Organization:
ar: المنظمة:
es: Organización:
fi: Organisaatio:
fr: Organisation :
hi: संगठन:
id: Organisasi:
pt: Organização:
zh: 组织:

# titleLabel
source: Title:
ar: المسمى الوظيفي:
es: Título:
fi: Titteli:
fr: Titre :
hi: शीर्षक:
id: Judul:
pt: Título:
zh: 职位:

# phoneLabel
source: Phone:
ar: الهاتف:
es: Teléfono:
fi: Puhelin:
fr: Téléphone :
hi: फोन:
id: Telepon:
pt: Telefone:
zh: 电话:

# emailLabel
source: Email:
ar: البريد الإلكتروني:
es: Correo Electrónico:
fi: Sähköposti:
hi: ईमेल:
zh: 邮箱:

# addressLabel
source: Address:
ar: العنوان:
es: Dirección:
fi: Osoite:
fr: Adresse :
hi: पता:
id: Alamat:
pt: Endereço:
zh: 地址:

# websiteLabel
source: Website:
ar: الموقع الإلكتروني:
es: Sitio Web:
fi: Verkkosivu:
fr: Site Web :
hi: वेबसाइट:
id: Situs Web:
zh: 网站:

# noteLabel
source: Note:
ar: ملاحظة:
es: Nota:
fi: Huomautus:
hi: नोट:
id: Catatan:
pt: Nota:
zh: 备注:

# wifiNetworkLabel
source: Wi-Fi Network:
ar: شبكة Wi-Fi:
es: Red Wi-Fi:
fi: Wi-Fi-verkko:
fr: Réseau Wi-Fi :
hi: Wi-Fi नेटवर्क:
id: Jaringan Wi-Fi:
pt: Rede Wi-Fi:
zh: Wi-Fi网络:

# typeLabel
source: Type:
ar: النوع:
es: Tipo:
fi: Tyyppi:
hi: प्रकार:
id: Tipe:
pt: Tipo:
zh: 类型:

# passwordLabel
source: Password:
ar: كلمة المرور:
es: Contraseña:
fi: Salasana:
fr: Mot de Passe :
hi: पासवर्ड:
id: Kata Sandi:
pt: Senha:
zh: 密码:

# noPasswordLabel
source: N/A (maybe no password)
ar: N/A (ربما لا توجد كلمة مرور)
es: N/A (puede que no tenga contraseña)
fi: Ei saatavilla (ei salasanaa)
fr: N/A (peut-être sans mot de passe)
hi: N/A (कोई पासवर्ड नहीं)
id: N/A (mungkin tidak ada kata sandi)
pt: N/D (talvez sem senha)
zh: 无(可能没有密码)

# hiddenLabel
source: Hidden:
ar: مخفي:
es: Oculto:
fi: Piilotettu:
fr: Caché :
hi: छिपा हुआ:
id: Tersembunyi:
pt: Oculto:
zh: 隐藏:

# toLabel
source: To:
ar: إلى:
es: Para:
fi: Vastaanottaja:
fr: À :
hi: को:
id: Kepada:
pt: Para:
zh: 收件人:

# subjectLabel
source: Subject:
ar: الموضوع:
es: Asunto:
fi: Aihe:
fr: Sujet :
hi: विषय:
id: Subjek:
pt: Assunto:
zh: 主题:

# bodyLabel
source: Body:
ar: المحتوى:
es: Cuerpo:
fi: Viesti:
fr: Corps :
hi: बॉडी:
id: Isi:
pt: Corpo:
zh: 正文:

# latitudeLabel
source: Latitude:
ar: خط العرض:
es: Latitud:
fi: Leveysaste:
hi: अक्षांश:
id: Lintang:
zh: 纬度:

# longitudeLabel
source: Longitude:
ar: خط الطول:
es: Longitud:
fi: Pituusaste:
hi: देशांतर:
id: Bujur:
zh: 经度:

# altitudeLabel
source: Altitude:
ar: الارتفاع:
es: Altitud:
fi: Korkeus:
hi: ऊंचाई:
id: Ketinggian:
zh: 海拔:

# labelLabel
source: Label:
ar: تسمية:
es: Etiqueta:
fi: Nimike:
fr: Étiquette :
hi: लेबल:
pt: Rótulo:
zh: 标签:

# noVCardData
source: No vCard data to export.
ar: لا توجد بيانات vCard للتصدير.
es: No hay datos vCard para exportar.
fi: Ei vCard-tietoja vietäväksi.
fr: Aucune donnée vCard à exporter.
hi: निर्यात करने के लिए कोई vCard डेटा नहीं।
id: Tidak ada data vCard untuk diekspor.
pt: Nenhum dado vCard para exportar.
zh: 没有可导出的vCard数据。

# hidePasswordTooltip
source: Hide password
ar: إخفاء كلمة المرور
es: Ocultar contraseña
fi: Piilota salasana
fr: Masquer le mot de passe
hi: पासवर्ड छिपाएं
id: Sembunyikan kata sandi
pt: Ocultar senha
zh: 隐藏密码

# showPasswordTooltip
source: Show password
ar: إظهار كلمة المرور
es: Mostrar contraseña
fi: Näytä salasana
fr: Afficher le mot de passe
hi: पासवर्ड दिखाएं
id: Tampilkan kata sandi
pt: Mostrar senha
zh: 显示密码

# yesLabel
source: Yes
ar: نعم
es: Sí
fi: Kyllä
fr: Oui
hi: हाँ
id: Ya
pt: Sim
zh: 是

# noLabel
source: No
ar: لا
fi: Ei
fr: Non
hi: नहीं
id: Tidak
pt: Não
zh: 否

source: Error requesting permission.
ar: خطأ في طلب الإذن.
es: Error al solicitar permiso.
fi: Virhe lupaa pyydettäessä.
fr: Erreur lors de la demande de permission.
hi: अनुमति अनुरोध करने में त्रुटि।
id: Gagal meminta izin.
pt: Erro ao solicitar permissão.
zh: 请求权限出错。

source: Error receiving barcode data.
ar: خطأ في استقبال بيانات الباركود.
es: Error al recibir datos del código de barras.
fi: Virhe viivakooditietojen vastaanotossa.
fr: Erreur lors de la réception des données du code-barres.
hi: बारकोड डेटा प्राप्त करने में त्रुटि।
id: Gagal menerima data barcode.
pt: Erro ao receber dados do código de barras.
zh: 接收条码数据出错。

source: Failed to set up barcode listener.
ar: فشل في إعداد مستمع الباركود.
es: Error al configurar el escuchador de códigos de barras.
fi: Viivakoodin kuuntelijan asettaminen epäonnistui.
fr: Échec de la configuration de l'écouteur de code-barres.
hi: बारकोड लिसनर सेटअप करने में विफल।
id: Gagal menyiapkan pendengar barcode.
pt: Falha ao configurar o ouvinte de código de barras.
zh: 设置条码监听器失败。

source: Could not toggle flash.
ar: تعذر تبديل الفلاش.
es: No se pudo alternar el flash.
fi: Salakuvan vaihtaminen epäonnistui.
fr: Impossible d'activer/désactiver le flash.
hi: फ्लैश टॉगल नहीं कर सका।
id: Gagal mengaktifkan/menonaktifkan flash.
pt: Não foi possível alternar o flash.
zh: 无法切换闪光灯。

source: Could not switch camera.
ar: تعذر تبديل الكاميرا.
es: No se pudo cambiar de cámara.
fi: Kameran vaihtaminen epäonnistui.
fr: Impossible de changer de caméra.
hi: कैमरा स्विच नहीं कर सका।
id: Gagal mengganti kamera.
pt: Não foi possível trocar a câmera.
zh: 无法切换相机。

# cameraStartError
source: Failed to start camera. Error: {error}
ar: فشل في بدء الكاميرا. الخطأ: {error}
es: Error al iniciar la cámara. Error: {error}
fi: Kameran käynnistys epäonnistui. Virhe: {error}
fr: Échec du démarrage de la caméra. Erreur : {error}
hi: कैमरा शुरू करने में विफल। त्रुटि: {error}
id: Gagal memulai kamera. Error: {error}
pt: Falha ao iniciar a câmera. Erro: {error}
zh: 启动相机失败。错误: {error}

# cameraGenericError
source: An unexpected error occurred while starting the camera.
ar: حدث خطأ غير متوقع أثناء بدء الكاميرا.
es: Ocurrió un error inesperado al iniciar la cámara.
fi: Kameran käynnistyksessä tapahtui odottamaton virhe.
fr: Une erreur inattendue s'est produite lors du démarrage de la caméra.
hi: कैमरा शुरू करते समय एक अप्रत्याशित त्रुटि हुई।
id: Terjadi kesalahan tak terduga saat memulai kamera.
pt: Ocorreu um erro inesperado ao iniciar a câmera.
zh: 启动相机时发生意外错误。

# cameraPermissionDeniedInSettings
source: Camera permission denied. Please grant permission in settings.
ar: تم رفض إذن الكاميرا. يرجى منح الإذن في الإعدادات.
es: Permiso de cámara denegado. Por favor, concede el permiso en la configuración.
fi: Kameran käyttöoikeus evätty. Anna lupa asetuksista.
fr: Autorisation de la caméra refusée. Veuillez accorder la permission dans les paramètres.
hi: कैमरा अनुमति अस्वीकृत। कृपया सेटिंग्स में अनुमति दें।
id: Izin kamera ditolak. Harap berikan izin di pengaturan.
pt: Permissão da câmera negada. Por favor, conceda a permissão nas configurações.
zh: 相机权限被拒绝。请在设置中授予权限。

# cameraPermissionDeniedOrRevoked
source: Camera permission was denied or revoked. Please grant permission in app settings.
ar: تم رفض إذن الكاميرا أو إلغاؤه. يرجى منح الإذن في إعدادات التطبيق.
es: El permiso de cámara fue denegado o revocado. Por favor, concede el permiso en la configuración de la aplicación.
fi: Kameran käyttöoikeus evätty tai peruutettu. Anna lupa sovelluksen asetuksista.
fr: L'autorisation de la caméra a été refusée ou révoquée. Veuillez accorder la permission dans les paramètres de l'application.
hi: कैमरा अनुमति अस्वीकृत या रद्द कर दी गई। कृपया ऐप सेटिंग्स में अनुमति दें।
id: Izin kamera ditolak atau dicabut. Harap berikan izin di pengaturan aplikasi.
pt: A permissão da câmera foi negada ou revogada. Por favor, conceda a permissão nas configurações do aplicativo.
zh: 相机权限被拒绝或撤销。 请在应用设置中授予权限。

# cameraNotSupported
source: Camera is unavailable or not supported on this device.
ar: الكاميرا غير متوفرة أو غير مدعومة على هذا الجهاز.
es: La cámara no está disponible o no es compatible con este dispositivo.
fi: Kamera ei ole saatavilla tai sitä ei tueta tällä laitteella.
fr: La caméra est indisponible ou non supportée sur cet appareil.
hi: इस डिवाइस पर कैमरा अनुपलब्ध या समर्थित नहीं है।
id: Kamera tidak tersedia atau tidak didukung di perangkat ini.
pt: A câmera não está disponível ou não é suportada neste dispositivo.
zh: 此设备不支持或无法使用相机。

# fileScreenTitle
source: Scan from File
ar: مسح من ملف
es: Escanear desde Archivo
fi: Skannaa Tiedostosta
fr: Scanner à partir d'un Fichier
hi: फ़ाइल से स्कैन करें
id: Pindai dari Berkas
pt: Escanear de Arquivo
zh: 从文件扫描

# pickImageButtonText
source: Pick Image & Scan
ar: اختيار صورة ومسح
es: Seleccionar Imagen y Escanear
fi: Valitse Kuva ja Skannaa
fr: Choisir une Image & Scanner
hi: छवि चुनें और स्कैन करें
id: Pilih Gambar & Pindai
pt: Escolher Imagem e Escanear
zh: 选择图片并扫描

# fileScreenInstruction
source: Select an image containing a QR code from your gallery.
ar: حدد صورة تحتوي على رمز QR من معرضك.
es: Selecciona una imagen que contenga un código QR de tu galería.
fi: Valitse kuvagalleriastasi kuva, joka sisältää QR-koodin.
fr: Sélectionnez une image contenant un QR code dans votre galerie.
hi: अपने गैलरी से QR कोड वाली एक छवि चुनें।
id: Pilih gambar yang berisi QR code dari galeri Anda.
pt: Selecione uma imagem contendo um código QR da sua galeria.
zh: 从相册中选择包含二维码的图片。

# chooseImageMessage
source: Choose an image...
ar: اختيار صورة...
es: Elige una imagen...
fi: Valitse kuva...
fr: Choisir une image...
hi: एक छवि चुनें...
id: Memilih gambar...
pt: Escolher uma imagem...
zh: 选择图片...

# processingMessage
source: Processing...
ar: جاري المعالجة...
es: Procesando...
fi: Käsitellään...
fr: Traitement...
hi: प्रसंस्करण...
id: Memproses...
pt: Processando...
zh: 处理中...

# scanningImageMessage
source: Scanning image...
ar: جاري مسح الصورة...
es: Escaneando imagen...
fi: Skannataan kuvaa...
fr: Scan de l'image...
hi: छवि स्कैन की जा रही है...
id: Memindai gambar...
pt: Escaneando imagem...
zh: 正在扫描图片...
